[
  {
    "id": "b183af68-32be-44da-a9e7-63162d68419f",
    "title": "Junior Developer Intern",
    "company": "SparkPlus Technologies",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Responsibilities:\n\nCollaborate with the development team to design, develop, and test software applications with a strong focus on product functionality and user experience.\nAssist in troubleshooting and resolving software defects or issues, ensuring the stability and reliability of the applications.\nParticipate in code reviews to maintain code quality, optimize performance, and adhere to coding standards.\nContribute to the creation and maintenance of technical documentation to ensure clarity and ease of use for future reference.\nStay updated with the latest technologies, tools, and frameworks relevant to our product stack, and propose innovative solutions to enhance software development processes.\nAssist in identifying areas of improvement within the software applications and actively contribute to their implementation.\nCollaborate with cross-functional teams to gather requirements, understand product needs, and translate them into technical specifications.\nSupport the integration of third-party APIs and external services to extend the functionality of our software applications.\nDevelop and execute software test plans and test cases to ensure the quality and reliability of the applications.\nWork closely with team members to meet project deadlines, deliver high-quality software solutions, and contribute to the success of our products.\n\nRequirements:\n\nCompleted degree in Computer Science, Software Engineering, or a related field.\nPassionate about software development and programming, with a demonstrated interest in building innovative solutions.\nStrong understanding of software development methodologies, data structures, algorithms, and object-oriented programming principles.\nSolid problem-solving and analytical skills, with the ability to translate requirements into practical technical solutions.\nAttention to detail and commitment to writing clean, maintainable code to ensure software quality and longevity.\nExcellent communication and teamwork skills, with the ability to collaborate effectively with team members and stakeholders.\nEnthusiasm for learning and keeping up with emerging technologies and programming languages.\nAbility to work independently, manage time effectively, and prioritize tasks to meet project deadlines.\n\nAttractive Perks and Incentives:\n\nIn addition to gaining valuable experience and enhancing your programming skills, we offer a range of perks and incentives to make your internship as a Junior Developer even more rewarding. Here are some of the benefits you can expect:\n\nCompetitive Compensation: We offer a competitive internship package that recognizes your skills, contributions, and commitment to the role.\n\nLearning and Development Opportunities: As a Junior Developer intern, you will have access to various learning resources, including workshops, training programs, and online courses. These opportunities will help you sharpen your technical skills, learn new programming languages, and stay updated with industry trends.\n\nMentorship and Guidance: We believe in the power of mentorship. Throughout your internship, you will have the opportunity to work closely with experienced developers who will provide guidance, share their knowledge, and help you grow both technically and professionally.\n\nReal-World Project Experience: You will work on real-world projects, allowing you to apply your programming skills to practical scenarios. This hands-on experience will boost your confidence and help you build a strong portfolio.\n\nCollaborative Team Environment: We foster a collaborative and inclusive work environment where you can collaborate with talented professionals from various disciplines. You will have the opportunity to learn from your colleagues and contribute to a supportive team dynamic.\n\nProfessional Networking: We encourage networking opportunities by organizing events and activities where you can connect with industry professionals, build relationships, and expand your professional network.\n\nFlexible Work Environment: We understand the importance of work-life balance and offer flexibility in terms of work hours and remote work arrangements whenever possible.\n\nRecognition and Rewards: We value and appreciate hard work and outstanding performance. You will have the chance to be recognized and rewarded for your achievements through various programs and initiatives.\n\nCareer Development Path: As a Junior Developer intern, you will have the opportunity to explore career paths within our organization. Exceptional performance may open doors to future employment or extended project engagements.\n\nFun and Social Activities: We believe in fostering a positive work culture. We organize social events, team-building activities, and celebrations to ensure you have an enjoyable and fulfilling internship experience.\n\nJoin our team as a Junior Developer intern and take advantage of these exciting perks and incentives that will contribute to your long-term success and growth in the field of software development.\n\nStipend: Rs 2000/- + Performance-based incentives and Potential Hiring Opportunity.\n\nDuration: Full time, 3 months\n\nJob Types: Fresher, Internship\nContract length: 3 months\n\nPay: ₹2,000.00 per month\n\nBenefits:\n\nFlexible schedule\nPaid sick time\nWork from home\n\nWork Location: Remote",
    "applyLink": "https://in.indeed.com/viewjob?cmp=SparkRex-Technologies&t=Junior+Developer&jk=372235a734e63d9a&xpse=SoDA67I3nlXI_MTN8J0LbzkdCdPP&xfps=afab39cd-5451-4148-991f-86a41ce8051b&xkcb=SoCI67M3nlXJcszNoZ0LbzkdCdPP&vjs=3",
    "skills": [],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "6a2f9710-10c9-4f27-85d5-a8f5b69b6815",
    "title": "Software Engineer Intern",
    "company": "123 of AI",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "You should apply if you:\nLove figuring things out, learning fast, and taking ownership\nWant to build features from 0 1 or scale them 1 10\nAre curious about startups, or want to build your own someday\nHave built and deployed at least one full-stack project (from scratch or in a team)\nAre ultra-ambitious and have a high-growth, high-impact ownership mentality.\nWhat You'll Work On:\nBuild engaging learning tools with adaptive and personalized learning paths.\nImprove our automated interview training system that uses multimodal analysis (video, audio, speech).\nAdd gamification features to drive retention and engagement across our programs.\nShip high-quality features end-to-end, from UI to backend APIs.\nCollaborate directly with our founder and senior engineers on product and tech decisions.\nQualifications:\nGood with front-end UI/UX Design\nExperience in building+deploying websites end-to-end\nWriting production-grade backend APIs\nCore Technological Skills Required:\nReact, NextJs, Tailwind/ShadCN\nExpressJS\nAzure Cloud Services\nML/Dev Ops (Github Actions + CI/CD + Monitoring)\nTime-Period & Commitment:\n3 months\n40-45 hours/week (Apply only if you can give full-time commitment)\nExpected Stipend:\n~18k/month\nAbout Us:\nWe are a bootstrapped ed-tech company helping working professionals upskill in AI/ML.\nWe do so via our upskilling programs, software tools, and structured mentorship.\nWe have a competent team, with people from CMU, IIIT-H, NIT-K, DAVV, etc.\nYou'll be working closely with our founder, Abbhinav Venkat, who is an ex-Stanford AI researcher, and has been a part of multiple Silicon Valley startups.",
    "applyLink": "https://in.indeed.com/viewjob?jk=868dc75e5d7b71f7&from=serp&vjs=3",
    "skills": [
      "React",
      "Azure",
      "UI/UX",
      "CI/CD"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "6187152e-f479-48f7-864a-b75b7c609ff7",
    "title": "Software Developer Intern",
    "company": "RaftLabs",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Job Information\n\nDate Opened\n\n01/30/2026\n\nJob Type\n\nTraining\n\nIndustry\n\nIT Services\n\nSalary\n\n5 - 12K/Month\n\nRemote Job\n\nJob Description\n\nThis is a remote position.\n\nWe are looking for a passionate Software Developer Intern with hands-on experience in Next.js, React, and TailwindCSS. You will work closely with our engineering team to build high-quality, scalable web applications. If you are someone who learns fast, enjoys problem-solving, and uses AI tools to speed up development, this role is perfect for you. The duration of this internship will be 6 Months.\n\n\nDevelop responsive and user-friendly UI using React, Next.js, and TailwindCSS\n\nAssist in building new features and improving existing components\n\nCollaborate with designers, PMs, and senior engineers\n\nWrite clean, maintainable, and reusable code\n\nUse AI tools (e.g., GitHub Copilot, ChatGPT) to optimize development workflow\n\nParticipate in code reviews and follow best engineering practices\n\nDebug issues and contribute to performance improvements\n\n\n\n\nRequirements\nGood understanding of JavaScript, React, and Next.js\n\nExperience building UI with TailwindCSS\n\nStrong problem-solving and analytical thinking\n\nFamiliarity with Git/GitHub\n\nAbility to learn quickly and adapt to new tools and technologies\n\nExperience using AI-powered coding tools is a plus\n\n\n\nBenefits\nHands-on experience working on live projects\n\nGuidance and mentorship from experienced developers\n\nOpportunity to learn modern development workflows and AI-assisted programming\n\nExposure to full-stack product development cycles\n\nCertificate of Internship & potential full-time offer based on performance",
    "applyLink": "https://in.indeed.com/viewjob?jk=d6af4ccdd7b024d0&from=serp&vjs=3",
    "skills": [
      "JavaScript",
      "React",
      "Git"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "04148063-edc6-4089-b4da-e7973bf46bd5",
    "title": "Intern - Software",
    "company": "Newspace",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Job Description: Full Stack Developer Intern\nPosition: Software Intern Communication\nLocation: Bangalore\nDuration: 6 months\n\nAbout the Role:\n-\nWe are seeking a motivated and curious Full Stack Developer Intern with a strong\nfoundation in both web technologies and computer networking. This is an exciting\nopportunity to work on real-world IoT/Edge/Network-integrated systems and contribute\nto backend, frontend, and networking layer integrations.\nResponsibilities:\n-\nBuild and maintain full stack applications (React/Flask/NodeJS etc.)\nIntegrate backend logic with networking protocols (e.g., socket programming, REST\nAPIs,OS )\nDevelop dashboards for real-time data visualization from network devices\nInterface with systems like routers, Raspberry Pi\nWrite scripts and tools to monitor or control network-connected devices\nAssist in deploying apps using Docker, SSH, or cloud platforms (AWS/GCP)\nTech Stack:\n-\nFrontend: React.js / HTML / CSS / JavaScript\nBackend: Flask / Node.js / Python / Java /C++\nNetworking: Basic TCP/IP, WebSockets, SSH, VPN, REST\nDatabase: MongoDB / PostgreSQL / SQLite\n\nRequirements:\n-\nCurrently pursuing or recently completed B.Tech/B.E/MCA in CS/IT/ECE or related field\nKnowledge of basic networking concepts\nExperience with any backend and frontend framework\nFamiliarity with Linux and terminal-based debugging\nEagerness to learn and solve practical networking + software problems\nGood to Have:\nExposure to Raspberry Pi or IoT projects\n\nInterview Process\n-\nStage 1: Resume Screening & Quick Call\nCheck basic qualifications, enthusiasm, project experience\nAsk about any networking/IoT or full stack mini-projects\nStage 2: Technical Round 1\nMini project or assignment (e.g., “Build a simple Flask app to show data from a network\ndevice in a dashboard”, or “Simulate two systems sending JSON data and aggregate it”)\nStage 3: Technical Round 2\n10 min: Networking basics\n10 min: Full stack logic\n10 min: Data Structure problem\n10 min: Discussion on learning goals & future interest",
    "applyLink": "https://in.indeed.com/viewjob?jk=3088acf17324ca82&from=serp&vjs=3",
    "skills": [
      "JavaScript",
      "Python",
      "Java",
      "React",
      "Node.js",
      "Flask",
      "MongoDB",
      "PostgreSQL",
      "HTML",
      "CSS",
      "Docker",
      "AWS",
      "GCP",
      "Linux"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "f76996e6-c26f-4f53-b6fb-6c01fa70846d",
    "title": "Intern – Software Developer",
    "company": "Fospe",
    "location": null,
    "type": "Hybrid",
    "stipend": null,
    "duration": null,
    "description": "About Fospe\n\nFospe is a digital transformation and technology-driven company focused on building scalable software solutions. We work with modern technologies and global clients, providing young talent the opportunity to grow in a real-world development environment.\n\nRole Overview\n\nWe are looking for passionate and motivated Software Developer Interns with a strong interest in Node.js development. This internship is ideal for fresh graduates who want hands-on experience working on live projects under the guidance of experienced developers.\n\nResponsibilities\nAssist in developing and maintaining backend applications using Node.js\nWork with APIs, databases, and server-side logic\nCollaborate with senior developers and cross-functional teams\nDebug, test, and optimize application performance\nLearn and follow best coding practices and documentation standards\nRequired Skills\nBasic knowledge of JavaScript and Node.js\nUnderstanding of REST APIs\nFamiliarity with databases (MongoDB/MySQL is a plus)\nBasic knowledge of Git or version control\nStrong problem-solving and learning mindset\nEligibility Criteria\nFreshers who graduated in 2023 or 2024 only\nBachelor’s degree in Computer Science, IT, or related field\nWillingness to work in a hybrid model\nGood communication and teamwork skills\nWhat We Offer\nHands-on experience with real-world projects\nMentorship from experienced developers\nHybrid working flexibility\nInternship certificate upon successful completion\nOpportunity for full-time employment based on performance\n\nHow to Apply:\nApply via LinkedIn only:\nhttps://rb.gy/fb6dir\nJob Category: Software\nJob Type: Full Time\nJob Location: Bangalore Dubai",
    "applyLink": "https://in.indeed.com/viewjob?jk=24a2b6dc7a3359bd&from=serp&vjs=3",
    "skills": [
      "JavaScript",
      "Node.js",
      "MongoDB",
      "MySQL",
      "Git"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "f833ed97-b7f1-4562-b0c2-9e76a5aba807",
    "title": "Software Developer Intern (Python)",
    "company": "Coderwing",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Job Title: Python Developer Intern\nCompany: CoderWing\nDuration: 3 Months (Internship)\n\nCoderWing is hiring Python Developer Interns. Candidates will work on live projects and get hands-on training.\n\nSkills: Basic Python, OOP concepts, API/Database knowledge (preferred)\n\nEligibility: Anyone can apply (Students/Freshers)\n\nInterested candidates can apply by sending their resume to inquiry.coderwing@gmail.com\n\nJob Types: Fresher, Internship\nContract length: 3 months\n\nPay: ₹6,718.76 - ₹8,143.22 per month\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=CoderWing&t=Software+Engineer&jk=8f1644ed7402b5b6&xpse=SoDc67I3nlXGlnT77h0LbzkdCdPP&xfps=21e6fda8-ec1a-4ed9-a607-9c55c542485c&xkcb=SoAv67M3nlXJcszNoZ0ObzkdCdPP&vjs=3",
    "skills": [
      "Python"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "0611db38-2c4c-4033-85ab-1b6b8ab713c7",
    "title": "Software Engineer Intern",
    "company": "Auxiliobits Technologies Pvt Ltd",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "AUXILIOBITS TECHNOLOGY PRIVATE LIMITED\n\nJOB DESCRIPTION FOR SOFTWARE ENGINEER INTERN\n\n· ABOUT THE ROLE- Do you have a desire to excel in software programming and learn new technologies under great mentors? Are you hands-on programmer who knows basic concepts and how software programs interact and behave in different environments? If yes then this is a great opportunity for you to work with us and learn and deliver ultimately. You will start as software trainee and then get a full time job on the basis of your mentor’s feedback.\n\n· SKILLS- You must have the following skills to do it!\n\no Good Communication Skills\n\no Handson .NET development or any one OOPs Programming language like python, java\n\no Good Analytical skills, Problem solving skills and be able to take initiative\n\no Must have completed projects (Should know json, APIs, xml, HTML, CSS JS)\n\n· EXPERIENCE - 0-1 years of experience based on the pandemic situation you will need either join our Chandigarh office or work from home. Ability to relocate should be exemplified at the time of interview.\n\n· STIPEND- Offering 12 thousand stipend during internship and after completion of training duration on the basis of their mentor’s feedback, we will offer 3.6 lpa.\n\nJob Type: Full-time\n\nPay: ₹360,000.00 - ₹400,000.00 per year\n\nBenefits:\n\nFood provided\nProvident Fund\n\nAbility to commute/relocate:\n\nSahibzada Ajit Singh Nagar, Mohali, Punjab: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n\ntotal work: 1 year (Preferred)\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=Auxiliobits-Technologies-Pvt-Ltd&t=Software+Engineer+Intern&jk=c3527248ecf2fc0c&xpse=SoBp67I3nlXGZPTDR50LbzkdCdPP&xfps=7680b22e-2036-4b04-80dc-ccb1b9925a78&xkcb=SoCy67M3nlXJcszNoZ0NbzkdCdPP&vjs=3",
    "skills": [
      "Python",
      "Java",
      "HTML",
      "CSS",
      "Excel"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "2385ecf3-04a5-4db1-9779-97ce18c82fd8",
    "title": "Software Tester Intern",
    "company": "PillerSoft Technology",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Job description:\n\nWe are seeking a motivated *Software Tester Intern* to gain hands-on experience in software quality assurance. You will work closely with our testing team to learn and apply testing techniques, execute test cases, and help ensure software quality.\n\nJob Role:\n\n- Learn and assist in software testing methodologies.\n\n- Execute test cases and track defects.\n\n- Collaborate with developers to analyze issues.\n\n- Perform regression, functional, and integration testing.\n\n- Contribute to improving testing processes.\n\nRequirements & Skills:\n\n- Pursuing/completed a Bachelor’s in Computer Science, Engineering, or related field.\n\n- Strong interest in software testing.\n\n- Basic understanding of testing concepts and Google word document and excel sheet\n\n- Detail-oriented with good analytical skills.\n\n- Strong communication and teamwork abilities.\n\n- Eager to learn and adapt to new tools.\n\nJoin us to gain practical experience and build a strong foundation in software testing!\n\nJob Types: Full-time, Internship\nContract length: 6 months\n\nPay: ₹500.00 - ₹1,000.00 per month\n\nBenefits:\n\nWork from home\n\nApplication Question(s):\n\nDo you have knowledge of software testing?The candidate should have atleast basic knowledge of testing?\nHas the candidate completed any testing course previously or completed an internship in testing?\nDo you have a personal laptop and a proper internet connection?\n\nWork Location: Remote",
    "applyLink": "https://in.indeed.com/viewjob?cmp=PillerSoft-Technology&t=Software+Test+Engineer&jk=f96d0eec84623b35&xpse=SoBB67I3nlXF4fzN450LbzkdCdPP&xfps=7ff4f0cf-9eda-4108-b1e3-d1af4639ea19&xkcb=SoAG67M3nlXJcszNoZ0MbzkdCdPP&vjs=3",
    "skills": [
      "Excel"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "a13ee7e7-2bcd-4b3a-9678-7931be66b9ab",
    "title": "Software Engineer Intern",
    "company": "Zeksta Technology Pvt Ltd",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Location: On-site (Bangalore)\nDuration: 3 Months\nStipend: Unpaid\nNo. Of Opening: 10\nFull-Time Opportunity: Yes — Outstanding performers will receive a full-time offer\n\nAbout the Internship\n\nWe are hiring Software Engineer Interns who are passionate about coding and want hands-on experience working on real client projects.This internship will help you build strong technical skills in Node.js, React, JavaScript, Flutter, and React Native.\n\nResponsibilities\n\nAssist in developing software applications using Node.js, React, JavaScript, Flutter, or React Native (based on your skill area).\nWrite clean, efficient, and maintainable code.\nSupport API development, UI/UX implementation, and feature integration.\nParticipate in debugging, testing, and deployment activities.\nCollaborate with senior developers to build scalable solutions.\nResearch new tools, frameworks, and development best practices.\nDocument code and project-related information.\n\nRequired Skills (Any One or More of the Following)Core Programming Skills\n\nStrong understanding of DSAfundamentals.\nGood problem-solving and logical thinking ability.\n\nBackend Development\n\nBasic knowledge of Node.js.\nUnderstanding of REST APIs and databases (MongoDB/MySQL).\nFamiliarity with Git.\n\nFrontend Development\n\nBasic knowledge of React (hooks, components, state management).\nUnderstanding of HTML, CSS, JavaScript.\n\nMobile App Development\n\nBasic experience in Flutter (Dart) or React Native (JavaScript).\nUnderstanding of mobile UI/UX guidelines.\n\nEligibility\n\nBCA / MCA / B.Tech / B.E. / M.Tech students or any graduate.\nCandidates who want real industry experience and project exposure.\n\nWhat You Will Learn\n\nWorking on real-world client projects.\nAgile development process, Git workflow, API development, and deployment.\nIndustry standards for coding, testing, and documentation.\nMentorship from senior developers.\nHow to build production-ready applications.\n\nPerks & Benefits\n\nCertificate of Internship.\nLetter of Recommendation (Performance-based).\nOpportunity to convert into a full-time Software Developer role.\nDirect experience that strengthens your portfolio and resume.\n\nJob Type: Internship\nContract length: 3 months\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=Zeksta-Technology-Pvt-Ltd&t=Software+Engineer+Intern&jk=6f0e5b1b8d1fa45c&xpse=SoDl67I3nlXFFhz5Zh0LbzkdCdPP&xfps=2a488572-831d-4b98-aec7-db1b8e333930&xkcb=SoDv67M3nlXJcszNoZ0DbzkdCdPP&vjs=3",
    "skills": [
      "JavaScript",
      "React",
      "Node.js",
      "MongoDB",
      "MySQL",
      "HTML",
      "CSS",
      "Git",
      "UI/UX",
      "React Native",
      "Flutter",
      "Agile"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "fa9ac8af-de06-4ce7-a737-1bc2b0c2de81",
    "title": "Software Developer + Technical Support (Intern)",
    "company": "Furtados School of Music (FSM)",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Position:Software Developer + Technical Support (Intern)\n\nLocation: Hybrid/Remote\n\nDesired Skills & Job Responsibilities:\nEducation Qualification : B. E./B. Tech (Computer Science/IT) (Undergraduates please DO NOT apply)\nStrong knowledge of data structures and algorithms\nGood understanding of web concepts\nStrong in database concepts\nGood understanding of frontend technologies\nStrong passion for technology and a desire to learn about software troubleshooting.\nUse Large Language Models (LLMs) to identify and solve complex technical problems efficiently.\nHandle technical challenges with a problem-solving mindset and a can-do attitude.\nQuickly adapt to any technology stack as per the project requirements.",
    "applyLink": "https://in.indeed.com/viewjob?jk=cdf99f7ca210fac1&from=serp&vjs=3",
    "skills": [],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "5b9417c3-7bb1-4cf9-abdf-014b02285871",
    "title": "Full Stack Developer Intern",
    "company": "Nodded",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Role: Full Stack Developer Intern\nLocation: Remote (India)\nDuration: 3–6 Months\nStipend: As per the industry standards\nConversion: PPO for high performers\n\nAbout Nodded\n\nNodded is a stealth-mode startup building a modern discovery and digital identity platform for the service economy. We are designing how businesses, creators, and professionals present themselves, establish trust, and get discovered without fragmented tools.\n\nWhat You’ll Work On\n\nDesign and develop backend services and REST APIs\nBuild and maintain authentication, user profiles, and core data flows\nIntegrate AI-powered features such as search, recommendations, enrichment, or automation\nWork with databases for data modeling, querying, and optimization\nCollaborate with frontend to deliver end-to-end product features\nContribute to frontend components where needed to complete full-stack flows\n\nTech Stack (Indicative)\n\nTypescript , Node.js / Express (or similar backend frameworks)\nPostgreSQL / Firebase / Supabase\nPython (for AI/ML services, scripts, or integrations)\nReact / Next.js\nREST APIs\nGit & modern deployment workflows\n\nWhat We’re Looking For\n\nStrong fundamentals in backend development and programming concepts\nHands-on experience with Node.js and/or Python\nUnderstanding of databases, SQL, and backend architecture\nFamiliarity with Large Language Models (LLMs) and their practical use in applications\nExperience using Python for AI/ML workflows (experimentation, data handling, integrations)\nBasic frontend knowledge with React or similar frameworks\nAbility to think in terms of systems, data flow, and scalability\n\nGood to Have (Not Mandatory)\n\nExperience with full-stack projects or side products\nKnowledge of vector databases, embeddings, or AI pipelines\nExposure to cloud platforms and deployment\nUnderstanding of authentication, authorization, and security best practices\n\nWhy This Internship Matters\n\nWork on real, production-grade full-stack features\nGain hands-on experience building AI-enabled systems\nHigh ownership and direct founder mentorship\nPortfolio-worthy work on a live platform\nClear path to full-time opportunity based on performance\n\nJob Type: Internship\nContract length: 6 months\n\nPay: ₹5,000.00 - ₹10,000.00 per month\n\nBenefits:\n\nWork from home\n\nWork Location: Remote",
    "applyLink": "https://in.indeed.com/viewjob?cmp=Nodded&t=Full+Stack+Developer&jk=bb0af24d4b6db4b5&xpse=SoBF67I3nlXEejT5cx0LbzkdCdPP&xfps=f70402a1-7bdc-4ef5-98b5-5999080c6f3d&xkcb=SoDG67M3nlXJcszNoZ0BbzkdCdPP&vjs=3",
    "skills": [
      "Python",
      "React",
      "Node.js",
      "SQL",
      "PostgreSQL",
      "TypeScript",
      "Git",
      "Firebase"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "e2ef4ea6-7259-4eb7-bfda-0aa927c0e480",
    "title": "Software Developer Intern",
    "company": "Siddiquis Elite Associate Learning Private Limited",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Assist in designing, coding, testing, and debugging software applications\nWrite clean, simple, and reusable code under guidance of senior developers\nHelp in developing new features and improving existing ones\nParticipate in code reviews and learn best coding practices\nWork with programming languages like Java, Python, C++, JavaScript, or .NET (as required)\nSupport in fixing bugs and performance issues\nCollaborate with team members including developers, testers, and designers\nMaintain documentation for code and development processes\nLearn and use version control tools like Git/GitHub\nFollow company standards and project deadlines\n\nJob Type: Full-time\n\nPay: ₹12,660.50 - ₹30,000.00 per month\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=Siddiquis-Elite-Associate-Learning-Private-Limited&t=Software+Engineer&jk=9d4911a7f091d592&xpse=SoCK67I3nlXD2LTDWB0LbzkdCdPP&xfps=394771ec-280a-4eb1-a385-2073a70da502&xkcb=SoBy67M3nlXJcszNoZ0AbzkdCdPP&vjs=3",
    "skills": [
      "JavaScript",
      "Python",
      "Java",
      "Git"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "a0d3b4f1-d3c8-4191-a51a-c9085fb0bca0",
    "title": "Full Stack Developer Intern",
    "company": "Novixpert Private limited",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "We're\n\n#Hiring – Full Stack Developer Intern! Immediate joiners preferred.\n\nNovixpert Tech Inc. is a leader in innovative technology solutions, pushing the boundaries of what’s possible with vision intelligence. Our team is dedicated to creating cutting-edge products that leverage the latest advancements in software engineering, machine learning, and edge computing. We are seeking a passionate and talented Full Stack Developer Intern to join our team and contribute to the development of advanced web-based and edge-integrated software applications.\n\nJob Overview: As a Full Stack Developer Intern, you will work on developing end-to-end software applications that support high-performance vision-intelligence systems. You will help design, build, and optimize both the front-end and back-end components, ensuring seamless integration with machine learning pipelines and edge-based devices. This internship offers a unique opportunity to gain hands-on experience with modern web technologies, APIs, and scalable application architectures in a dynamic and supportive environment.\n\nKey Responsibilities:\nCollaborate with software and machine learning engineers to understand project requirements and objectives.\nDevelop and maintain front-end components using modern web technologies.\nAssist in writing clean, scalable code and participating in code reviews.\nTroubleshoot and resolve issues related to API calls, UI functionality, and backend performance.\nDocument development processes, API specifications, and system updates.\n\nQualifications:\nRecently graduated with a degree in Computer Science, Software Engineering, IT, or a related field.\nBasic understanding of full stack development concepts.\nKnowledge of RESTful APIs and basic software architecture principles.\nStrong problem-solving skills and attention to detail.\nExcellent communication and teamwork abilities.\nEagerness to learn and adapt to new technologies and frameworks.\n\nWhat We Offer:\n- Hands-on experience with full stack development in real-world applications.\n- Mentorship from experienced engineers and developers.\n- Opportunity to contribute to innovative vision-intelligence projects.\n- Flexible working hours and a collaborative, growth-oriented environment.\n\nInterested candidates are requested to share their updated resume at arshlan@novixpert.com\n\nJob Type: Internship\nContract length: 3-4 months\n\nPay: ₹300,000.00 - ₹350,000.00 per year\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=Novixpert-Private-limited&t=Full+Stack+Developer&jk=4ad6a9325f37c5da&xpse=SoAS67I3nlXDohzDWB0LbzkdCdPP&xfps=38639958-fced-4022-b5b1-ee6e92c0b4ec&xkcb=SoD867M3nlXJcszNoZ0HbzkdCdPP&vjs=3",
    "skills": [
      "Machine Learning"
    ],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "ec20c172-2413-42c7-af03-8df488554c47",
    "title": "Software Developer Intern",
    "company": "lerny technology",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "We are looking for passionate software developer interns eager to learn and contribute to real-world projects.\n\nContract length: 12 months\n\nwhatsapp only:9074730411\n\nJob Types: Full-time, Fresher, Internship\nContract length: 12 months\n\nPay: ₹1,000.00 - ₹12,000.00 per year\n\nWork Location: In person",
    "applyLink": "https://in.indeed.com/viewjob?cmp=lerny-technology&t=Software+Engineer&jk=c7bd02e1d6c9b461&xpse=SoAo67I3nlXDP1TNVx0LbzkdCdPP&xfps=5668d927-bef0-4cb1-9d95-20eb05e9c8a6&xkcb=SoBI67M3nlXJcszNoZ0GbzkdCdPP&vjs=3",
    "skills": [],
    "deadline": null,
    "source": "indeed"
  },
  {
    "id": "904df235-c4b3-4013-8201-b875e0aebe17",
    "title": "Full-Stack Developer Intern (Python & React)",
    "company": "Fusionpact Career",
    "location": null,
    "type": "Remote",
    "stipend": null,
    "duration": null,
    "description": "Job Title: Full-Stack Developer Intern(Python & React)\nCompany: Fusionpact Technology\nLocation: Remote\nExperience: 1–4 Years (Open to strong freshers with excellent project experience)\nEmployment Type: Full-time\nDuration: 12 months with a PPO conversion opportunity before the mark of 12 months.\n\nAbout Fusionpact Technology\nFusionpact Technology is a fast-growing IT consulting and product development company delivering next-generation digital solutions to global clients. We specialize in AI/ML, Cloud Computing, Automation, Blockchain, and modern software development, enabling businesses to drive digital transformation at scale.\nWe foster a learning-driven, innovation-focused culture where engineers work on real-world scalable products, collaborate with mentors, and grow rapidly in their careers.\n\nRole Overview\nWe are looking for a Full-Stack Developer Intern(Python & React) who can work across backend and frontend to build secure, scalable, and user-friendly web applications.\nYou will be involved in the complete development lifecycle — from API design and database development to UI implementation and deployment.\n\nKey Responsibilities\nDesign, develop, and maintain backend services and RESTful APIs using Python frameworks (FastAPI)\nBuild responsive, reusable, and high-performance frontend components using React.js\nIntegrate frontend applications with backend APIs to ensure seamless data flow\nWork with databases (PostgreSQL / MySQL / MongoDB) to design schemas and optimize queries\nImplement authentication, authorization, and role-based access control (RBAC)\nEnsure application performance, scalability, and security best practices\nDebug, test, troubleshoot, and optimize existing features across the stack\nCollaborate with product, design, and QA teams for smooth delivery\nParticipate in code reviews, sprint planning, and Agile development processes\nFollow clean coding standards, documentation, and best software engineering practices\n\nRequired Skills\nStrong understanding of Python programming\nHands-on experience with React.js\nExperience building and consuming REST APIs\nSolid knowledge of HTML, CSS, JavaScript (ES6+)\nFamiliarity with relational and NoSQL databases\nExperience with Git and version control systems\nUnderstanding of basic software architecture and system design\nStrong problem-solving skills and ability to work independently\n\nGood-to-Have Skills\nExperience with FastAPI or Django REST Framework\nState management tools (Redux / Context API)\nExposure to Docker & Docker Compose\nBasic cloud experience (AWS / GCP / Azure)\nUnit & integration testing practices\nCI/CD fundamentals and DevOps awareness\n\nWhat We Offer\nOpportunity to work on real-world scalable products\nLearning-focused environment with mentorship from senior engineers\nFull time conversion opportunity before 12 months mark\nFlexible work culture (Remote/Hybrid options)\nExposure to cutting-edge technologies across industries\nInclusive culture where collaboration matters more than hierarchy",
    "applyLink": "https://in.indeed.com/viewjob?jk=5f544bb8f8675349&from=serp&vjs=3",
    "skills": [
      "JavaScript",
      "Python",
      "React",
      "Django",
      "MongoDB",
      "PostgreSQL",
      "MySQL",
      "HTML",
      "CSS",
      "Git",
      "Docker",
      "AWS",
      "Azure",
      "GCP",
      "CI/CD",
      "Agile"
    ],
    "deadline": null,
    "source": "indeed"
  }
]